app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ('test', 'test', '2026-10-01 15:48:02.784102', '2026-10-01 15:48:02.784102') RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 2 LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 3 LIMIT 1
UPDATE "posts" SET "title" = 'test__test_test', "body" = 'test_test_test', "updated_at" = '2026-10-01 16:21:31.457103' WHERE "posts"."id" = 4
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
  def show
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 4 LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 4
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy!